; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph3 - mode
	image2 - mode
	image1 - mode
	infrared0 - mode
	image4 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star6 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Star1 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image4)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
)
(:goal (and
	(have_image Star9 image4)
	(have_image Star10 image2)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image2)
	(have_image Star13 image1)
	(have_image Star14 infrared0)
	(have_image Planet15 image2)
	(have_image Planet16 spectrograph3)
))

)

; plan
1. (turn_to satellite0 star1 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star1)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 star14 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star14)
   goals met: 0 of 8
5. (take_image satellite0 star14 instrument1 infrared0)
   added: (have_image star14 infrared0)
   goals met: 1 of 8
6. (turn_to satellite0 star13 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star13)
   goals met: 1 of 8
7. (take_image satellite0 star13 instrument1 image1)
   added: (have_image star13 image1)
   goals met: 2 of 8
8. (turn_to satellite0 planet16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet16)
   goals met: 2 of 8
9. (take_image satellite0 planet16 instrument1 spectrograph3)
   added: (have_image planet16 spectrograph3)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 8
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 8
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
14. (turn_to satellite0 groundstation4 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 8
15. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 4 of 8
16. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 8
17. (take_image satellite0 phenomenon12 instrument0 image2)
   added: (have_image phenomenon12 image2)
   goals met: 5 of 8
18. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 5 of 8
19. (take_image satellite0 planet15 instrument0 image2)
   added: (have_image planet15 image2)
   goals met: 6 of 8
20. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 6 of 8
21. (take_image satellite0 star10 instrument0 image2)
   added: (have_image star10 image2)
   goals met: 7 of 8
22. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
23. (take_image satellite0 star9 instrument0 image4)
   added: (have_image star9 image4)
   goals met: 8 of 8
